// Headers from this project
#include "tobe.hpp"

const QString tobe::
m_pronouns[7] = { "ես", "դու", "նա", "նա ", "մենք", "դուք", "նրանք" }; 

const QString tobe::
m_verbs[63] = {
        "կլինե՞մ", "կլինե՞ս", "կլինի՞", "կլինի՞",
        "կլինե՞նք", "կլինե՞ք", "կլինե՞ն",
        "կլինեմ", "կլինես", "կլինի", "կլինի",
        "կլինենք", "կլինեք", "կլինեն",
        "չեմ լինի", "չես լինի", "չի լինի", "չի լինի",
        "չենք լինի", "չեք լինի", "չեն լինի",
        "եմ", "ես", "է", "է", "ենք", "եք", "են",
        "եմ", "ես", "է", "է", "ենք", "եք", "են",
        "չեմ", "չես", "չի", "չի", "չենք", "չեք", "չեն",
        "եմ եղել", "ես եղել", "է եղել", "է եղել",
        "ենք եղել", "եք եղել", "են եղել",
        "եմ եղել", "ես եղել", "է եղել", "է եղել",
        "ենք եղել", "եք եղել", "են եղել",
        "չեմ եղել", "չես եղել", "չի եղել", "չի եղել",
        "չենք եղել", "չեք եղել", "չեն եղել",
};
