// Headers from this project
#include "verbs.hpp"

const QString verbs::
m_pronouns[7] = { "ես", "դու", "նա", "նա ", "մենք", "դուք", "նրանք" };

const QString verbs::
m_pron[63] = {
       "եմ", "ես", "է", "է", "ենք", "եք", "են",
       "եմ", "ես", "է", "է", "ենք", "եք", "են",
       "չեմ", "չես", "չի", "չի", "չենք", "չեք", "չեն",
       "եմ", "ես", "է", "է", "ենք", "եք", "են",
       "եմ", "ես", "է", "է", "ենք", "եք", "են",
       "չեմ", "չես", "չի", "չի", "չենք", "չեք", "չեն",
       "եմ", "ես", "է", "է", "ենք", "եք", "են",
       "եմ", "ես", "է", "է", "ենք", "եք", "են",
       "չեմ", "չես", "չի", "չի", "չենք", "չեք", "չեն",
};

const QString verbs::
m_verbs[63][2] = {
        { "սիրելո՞ւ", "տեսելո՞ւ"},
        { "սիրելո՞ւ", "տեսելո՞ւ"},
        { "սիրելո՞ւ", "տեսելո՞ւ"},
        { "սիրելո՞ւ", "տեսելո՞ւ"},
        { "սիրելո՞ւ", "տեսելո՞ւ"},
        { "սիրելո՞ւ", "տեսելո՞ւ"},
        { "սիրելո՞ւ", "տեսելո՞ւ"},
        
        { "սիրելու", "տեսնելու"},
        { "սիրելու", "տեսնելու"},
        { "սիրելու", "տեսնելու"},
        { "սիրելու", "տեսնելու"},
        { "սիրելու", "տեսնելու"},
        { "սիրելու", "տեսնելու"},
        { "սիրելու", "տեսնելու"},
        
        { "սիրելու", "տեսնելու"},
        { "սիրելու", "տեսնելու"},
        { "սիրելու", "տեսնելու"},
        { "սիրելու", "տեսնելու"},
        { "սիրելու", "տեսնելու"},
        { "սիրելու", "տեսնելու"},
        { "սիրելու", "տեսնելու"},
        
        { "սիրո՞ւմ", "տեսնո՞ւմ"},
        { "սիրո՞ւմ", "տեսնո՞ւմ"},
        { "սիրո՞ւմ", "տեսնո՞ւմ"},
        { "սիրո՞ւմ", "տեսնո՞ւմ"},
        { "սիրո՞ւմ", "տեսնո՞ւմ"},
        { "սիրո՞ւմ", "տեսնո՞ւմ"},
        { "սիրո՞ւմ", "տեսնո՞ւմ"},
        
        { "սիրում", "տեսնում"},
        { "սիրում", "տեսնում"},
        { "սիրում", "տեսնում"},
        { "սիրում", "տեսնում"},
        { "սիրում", "տեսնում"},
        { "սիրում", "տեսնում"},
        { "սիրում", "տեսնում"},
        
        { "սիրում", "տեսնում"},
        { "սիրում", "տեսնում"},
        { "սիրում", "տեսնում"},
        { "սիրում", "տեսնում"},
        { "սիրում", "տեսնում"},
        { "սիրում", "տեսնում"},
        { "սիրում", "տեսնում"},
        
        { "սիրել", "տեսել"},
        { "սիրել", "տեսել"},
        { "սիրել", "տեսել"},
        { "սիրել", "տեսել"},
        { "սիրել", "տեսել"},
        { "սիրել", "տեսել"},
        { "սիրել", "տեսել"},
        
        { "սիրել", "տեսել"},
        { "սիրել", "տեսել"},
        { "սիրել", "տեսել"},
        { "սիրել", "տեսել"},
        { "սիրել", "տեսել"},
        { "սիրել", "տեսել"},
        { "սիրել", "տեսել"},
        
        { "սիրել", "տեսել"},
        { "սիրել", "տեսել"},
        { "սիրել", "տեսել"},
        { "սիրել", "տեսել"},
        { "սիրել", "տեսել"},
        { "սիրել", "տեսել"},
        { "սիրել", "տեսել"},
};
